Ontaelio/STM32F103-Ublink-framework/stm32f103_timers_func.h
/*
 * STM32F103 Timers and IRQ library header file
 * Part of STM32F103 register and peripherals library
 *
 * Dpcumentation available in the provided MD file.
 *
 * (c) 2019-2020 Dmitry Reznikov ontaelio(at)gmail.com
 *
 * Can be freely used according to the GNU GPL license.
 */

#ifndef STM32F103_TIMERS_FUNC_H_
#define STM32F103_TIMERS_FUNC_H_

#include <stm32f103_rcc_reg.h>
#include <stm32f103_gpio_reg.h>
#include <stm32f103_gpio_func.h>
#include <stm32f103_timers_reg.h>
#include <stdio.h>

//**** SysTick stuff

void delay_ms(uint32_t msecs);
void delay_us(uint32_t msecs);
inline void sysTick_stop()
{
	SYSTICK_CSR &= ~SYSTICK_CSR_ENABLE;
}
void sysTick_start(uint32_t val, uint8_t intext = 1);
inline uint32_t sysTick_read()
{
	return SYSTICK_CURVAL;
}
inline void sysTick_intEnable()
{
	SYSTICK_CSR |= SYSTICK_CSR_TICKINT;
}
inline void sysTick_intDisable()
{
	SYSTICK_CSR &= ~SYSTICK_CSR_TICKINT;
}

//**** STM timers stuff

//center mode and direction values, CR1
#define CENTER_UP	 0x0002
#define CENTER_DOWN  0x0004
#define CENTER_BOTH  0x0006
#define PHASECORRECT 0x0006 //Arduino term
#define UPCOUNTER	 0x0000
#define DOWNCOUNTER	 0x0001

//master-slave modes defaults
//master mode, CR2 <<4
#define MMS_RESET		0x0000
#define MMS_ENABLE		0x0001
#define MMS_UPDATE		0x0002
#define MMS_COMPPULSE	0x0003
#define MMS_COMP1		0x0004
#define MMS_COMP2		0x0005
#define MMS_COMP3		0x0006
#define MMS_COMP4		0x0007

//slave mode, SMCR
#define SMS_DISABLE		0x0000
#define SMS_ENC1		0x0001
#define SMS_ENC2		0x0002
#define SMS_ENC3		0x0003
#define SMS_RESET		0x0004
#define SMS_GATED		0x0005
#define SMS_TRIGGER		0x0006
#define SMS_EXTCLK		0x0007

//trigger selection, SMCR <<4
//may add 8 to this value to enable MSM
#define TS_ITR0			0x0000
#define TS_ITR1			0x0001
#define TS_ITR2			0x0002
#define TS_ITR3			0x0003
#define TS_TI1F_ED		0x0004
#define TS_TI1FP1		0x0005
#define TS_TI1FP2		0x0006
#define TS_ETRF			0x0007

//master timer selection, internal value, not register-connected
#define ITR_TIM1	0x0100
#define ITR_TIM2	0x0200
#define ITR_TIM3	0x0300
#define ITR_TIM4	0x0400
#define ITR_TIM5	0x0500
#define ITR_TIM8	0x0800

//output compare modes, CCMRX <<4 & <<12
#define OCM_FROZEN		0x0000
#define OCM_HIGH		0x0001
#define OCM_LOW			0x0002
#define OCM_TOGGLE		0x0003
#define OCM_FORCELOW	0x0004
#define OCM_FORCEHIGH	0x0005
#define OCM_PWM1		0x0006
#define OCM_PWM2		0x0007
// master-slave end


inline void timer1_init()
{
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_TIM1EN | RCC_APB2ENR_AFIOEN;
}

inline void timer2_init()
{
	_RCC_(RCC_APB1ENR) |= RCC_APB1ENR_TIM2EN;
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_AFIOEN;
}

inline void timer3_init()
{
	_RCC_(RCC_APB1ENR) |= RCC_APB1ENR_TIM3EN;
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_AFIOEN;
}

inline void timer4_init()
{
	_RCC_(RCC_APB1ENR) |= RCC_APB1ENR_TIM4EN;
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_AFIOEN;
}

// abstract classes

class tim_pwm
{
protected:
	tim_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};

public:
	uint8_t pwmMode, centerMode, direction, polarity;
	uint16_t prescaler, depth;

	virtual ~tim_pwm() {}
	virtual void init(uint8_t pushpull = 0) =0;
	virtual void enable() =0;
	virtual void disable() =0;
	virtual void write(uint16_t pwm_val) =0;

protected:
	uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

class timer
{
protected:
	timer(uint16_t prsclr = 0x0000, uint16_t depth = 0xFFFF):
			 CR1	(0x0000), //basic configuration and enable (bit 0)
			 CR2	(0x0000), //master mode and Hall sensor
			 SMCR	(0x0000), //slave mode control
			 DIER	(0x0000), //interrupt enable
			 //SR	(0x0000), //status, non-configurable, bits must be cleared inside ISRs.
			 //EGR	(0x0000), //event generator. UG here, the rest emulates events (non-configurable)
			 CCMR1	(0x0000), //capture/compare mode
			 CCMR2	(0x0000),
			 CCER	(0x0000), //capture/compare enable
			 //CNT	(0x0000), //counter itself. Can be written to start at specific value
			 PSC	(prsclr), //prescaler
			 ARR	(depth),  //depth of the counter aka auto-reload
			 //RCR	(0x0000), //tim1 only, repeat counter, only one byte
			 CCR1	(0x0000), //capture/compare value. Read-only in input
			 CCR2	(0x0000),
			 CCR3	(0x0000),
			 CCR4	(0x0000),
			 //BDTR	(0x0000), //tim1 only. MOE here. Break, dead time, locks here.
			 DCR	(0x0000), //dma control
			 DMAR	(0x0000)  //dma burst stuff, 32 bits for tim1
			 {};

public:

    uint16_t CR1, CR2, SMCR, DIER, // SR, EGR,
			CCMR1, CCMR2, CCER, PSC, ARR, RCR, // CNT,
			CCR1, CCR2, CCR3, CCR4, DCR; //,BDTR;
	uint32_t DMAR; //32 bits in tim1 only

	virtual ~timer() {}
 	virtual void init() =0;
	virtual void config() =0;
	virtual void enableOnly() =0;
	virtual void enable(uint16_t count = 0)  =0;
	virtual void disable() =0;
	virtual uint16_t read() =0;
	//operator uint16_t() {return _TIM1_(TIMX_CNT);}

	virtual void master(uint16_t mms, uint16_t ccmr = 0) =0;
	virtual void slave(uint16_t sms, uint16_t ts) =0;

	void setMode(uint16_t mode) {CR1 &= ~0x0070; CR1 |= mode<<4;}
	void setCC1mode(uint16_t mode, uint8_t plrty = 0, uint8_t oe = 1);
	void setCC2mode(uint16_t mode, uint8_t plrty = 0, uint8_t oe = 1);
	void setCC3mode(uint16_t mode, uint8_t plrty = 0, uint8_t oe = 1);
	void setCC4mode(uint16_t mode, uint8_t plrty = 0, uint8_t oe = 1);

	void setUpdateIRQ(uint8_t bit=1) 	{DIER &= ~0x0001; DIER |= bit;}
	void setCC1IRQ(uint8_t bit=1)		{DIER &= ~0x0002; DIER |= bit<<1;}
	void setCC2IRQ(uint8_t bit=1)		{DIER &= ~0x0004; DIER |= bit<<2;}
	void setCC3IRQ(uint8_t bit=1)		{DIER &= ~0x0008; DIER |= bit<<3;}
	void setCC4IRQ(uint8_t bit=1)		{DIER &= ~0x0010; DIER |= bit<<4;}
	void setTriggerIRQ(uint8_t bit=1)	{DIER &= ~0x0040; DIER |= bit<<6;}

	void setCC1value(uint16_t val) {CCR1 = val;}
	void setCC2value(uint16_t val) {CCR2 = val;}
	void setCC3value(uint16_t val) {CCR3 = val;}
	void setCC4value(uint16_t val) {CCR4 = val;}

	void setDepth(uint16_t val) {ARR = val;}
	void setPrescaler(uint16_t val) {PSC = val;}

