Ontaelio/STM32F103-Ublink-framework/stm32f103_timers_func.h
	virtual void pwmSetup(uint8_t center, uint8_t dir)  =0;
	virtual void pwmChannel(uint8_t ch_num, uint8_t mode, uint8_t plrty, uint8_t pushpull = 0) =0;// {tim2_pwm a(ch_num); a.init();}
	virtual void pwmWrite(uint8_t ch_num, uint16_t val) =0;
	virtual void pwmEnable(uint8_t ch_num) =0;
	virtual void pwmDisable(uint8_t ch_num) =0;

	virtual void IRQenable() =0;
	virtual void IRQdisable() =0;

	virtual void writeCC1(uint16_t val) =0;
	virtual void writeCC2(uint16_t val) =0;
	virtual void writeCC3(uint16_t val) =0;
	virtual void writeCC4(uint16_t val) =0;

	//BB (atomic) stuff
	//update event enable/disable (CR1->UDIS)
	virtual void updateDisable() =0;
	virtual void updateEnable() =0;

	//fast interrupt enable/disable (1 or 0)
	virtual void updateInterrupt(uint8_t bit) =0;
	virtual void CC1interrupt(uint8_t bit) =0;
	virtual void CC2interrupt(uint8_t bit) =0;
	virtual void CC3interrupt(uint8_t bit) =0;
	virtual void CC4interrupt(uint8_t bit) =0;
	virtual void triggerInterrupt(uint8_t bit) =0;

	//event generators
	virtual void updateEvent() =0;
	virtual void CC1event() =0;
	virtual void CC2event() =0;
	virtual void CC3event() =0;
	virtual void CC4event() =0;
	virtual void triggerEvent() =0;

	//interrupt flag cleaners, should use BB for these most certainly
	virtual void clearUpdate() =0;
	virtual void clearCC1() =0;
	virtual void clearCC2() =0;
	virtual void clearCC3() =0;
	virtual void clearCC4() =0;
	virtual void clearTrigger() =0;
	virtual void clearAll() =0;

};

// inherited classes

class tim1_pwm : public tim_pwm
{
public:
//	tim1_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
//							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};
	tim1_pwm(uint8_t ch_num): tim_pwm(ch_num){}
	void init(uint8_t pushpull = 0);
	void enable();
	void disable() {_TIM1_(TIMX_CCER) &= ~(1<<((channel-1)*4));} //output off
	void write(uint16_t pwm_val) {_TIM1_(ch_addr) = pwm_val;}
	operator uint16_t() {return _TIM1_(ch_addr);}
	tim1_pwm& operator= (const uint16_t& a) {write(a); return *this;}
	tim1_pwm& operator++ () {write (_TIM1_(ch_addr) + 1); return *this;}
	tim1_pwm operator++ (int) {write (_TIM1_(ch_addr) + 1); return *this;}
	tim1_pwm& operator-- () {write (_TIM1_(ch_addr) - 1); return *this;}
	tim1_pwm operator-- (int) {write (_TIM1_(ch_addr) - 1); return *this;}
	tim1_pwm& operator+= (const uint16_t& a) {write (_TIM1_(ch_addr) + a); return *this;}
	tim1_pwm& operator-= (const uint16_t& a) {write (_TIM1_(ch_addr) - a); return *this;}
	//uint8_t pwmMode, centerMode, direction, polarity;
	//uint16_t prescaler, depth;

private:
	//uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

class tim2_pwm : public tim_pwm
{
public:
//	tim2_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
//							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};
	tim2_pwm(uint8_t ch_num): tim_pwm(ch_num){}
	void init(uint8_t pushpull = 0);
	void enable();
	void disable() {_TIM2_(TIMX_CCER) &= ~(1<<((channel-1)*4));} //output off
	void write(uint16_t pwm_val) {_TIM2_(ch_addr) = pwm_val;}
	operator uint16_t() {return _TIM2_(ch_addr);}
	tim2_pwm& operator= (const uint16_t& a) {write(a); return *this;}
	tim2_pwm& operator++ () {write (_TIM2_(ch_addr) + 1); return *this;}
	tim2_pwm operator++ (int) {write (_TIM2_(ch_addr) + 1); return *this;}
	tim2_pwm& operator-- () {write (_TIM2_(ch_addr) - 1); return *this;}
	tim2_pwm operator-- (int) {write (_TIM2_(ch_addr) - 1); return *this;}
	tim2_pwm& operator+= (const uint16_t& a) {write (_TIM2_(ch_addr) + a); return *this;}
	tim2_pwm& operator-= (const uint16_t& a) {write (_TIM2_(ch_addr) - a); return *this;}
	//uint8_t pwmMode, centerMode, direction, polarity;
	//uint16_t prescaler, depth;

private:
	//uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

class tim3_pwm : public tim_pwm
{
public:
//	tim3_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
//							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};
	tim3_pwm(uint8_t ch_num): tim_pwm(ch_num){}
	void init(uint8_t pushpull = 0);
	void enable();
	void disable() {_TIM3_(TIMX_CCER) &= ~(1<<((channel-1)*4));} //output off
	void write(uint16_t pwm_val) {_TIM3_(ch_addr) = pwm_val;}
	operator uint16_t() {return _TIM3_(ch_addr);}
	tim3_pwm& operator= (const uint16_t& a) {write(a); return *this;}
	tim3_pwm& operator++ () {write (_TIM3_(ch_addr) + 1); return *this;}
	tim3_pwm operator++ (int) {write (_TIM3_(ch_addr) + 1); return *this;}
	tim3_pwm& operator-- () {write (_TIM3_(ch_addr) - 1); return *this;}
	tim3_pwm operator-- (int) {write (_TIM3_(ch_addr) - 1); return *this;}
	tim3_pwm& operator+= (const uint16_t& a) {write (_TIM3_(ch_addr) + a); return *this;}
	tim3_pwm& operator-= (const uint16_t& a) {write (_TIM3_(ch_addr) - a); return *this;}
	//uint8_t pwmMode, centerMode, direction, polarity;
	//uint16_t prescaler, depth;

private:
	//uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

class tim4_pwm : public tim_pwm
{
public:
//	tim4_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
//							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};
	tim4_pwm(uint8_t ch_num): tim_pwm(ch_num){}
	void init(uint8_t pushpull = 0);
	void enable();
	void disable() {_TIM4_(TIMX_CCER) &= ~(1<<((channel-1)*4));} //output off
	void write(uint16_t pwm_val) {_TIM4_(ch_addr) = pwm_val;}
	operator uint16_t() {return _TIM4_(ch_addr);}
	tim4_pwm& operator= (const uint16_t& a) {write(a); return *this;}
	tim4_pwm& operator++ () {write (_TIM4_(ch_addr) + 1); return *this;}
	tim4_pwm operator++ (int) {write (_TIM4_(ch_addr) + 1); return *this;}
	tim4_pwm& operator-- () {write (_TIM4_(ch_addr) - 1); return *this;}
	tim4_pwm operator-- (int) {write (_TIM4_(ch_addr) - 1); return *this;}
	tim4_pwm& operator+= (const uint16_t& a) {write (_TIM4_(ch_addr) + a); return *this;}
	tim4_pwm& operator-= (const uint16_t& a) {write (_TIM4_(ch_addr) - a); return *this;}
	//uint8_t pwmMode, centerMode, direction, polarity;
	//uint16_t prescaler, depth;

