Ontaelio/STM32F103-Ublink-framework/stm32f103_timers_func.h
private:
	//uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

class timer1: public timer
{
public:
	timer1(uint16_t prsclr = 0x0000, uint16_t depth = 0xFFFF): timer(prsclr, depth), BDTR(TIMX_BDTR_MOE) {}
	uint16_t BDTR;

	void init() {timer1_init();}
	void config();
	void enableOnly() {BB_TIM1_CR1_CEN = 1;}
	void enable(uint16_t count = 0);
	void disable() {BB_TIM1_CR1_CEN = 0;}
	uint16_t read() {return _TIM1_(TIMX_CNT);}
	operator uint16_t() {return _TIM1_(TIMX_CNT);}

	void master(uint16_t mms, uint16_t ccmr = 0);
	void slave(uint16_t sms, uint16_t ts);

	void setCOMIRQ(uint8_t bit=1)		{DIER &= ~0x0020; DIER |= bit<<5;} //tim1 only
	void setBreakIRQ(uint8_t bit=1)		{DIER &= ~0x0080; DIER |= bit<<7;} //tim1 only

	void pwmSetup(uint8_t center, uint8_t dir);
	void pwmChannel(uint8_t ch_num, uint8_t mode, uint8_t plrty, uint8_t pushpull = 0);
	void pwmWrite(uint8_t ch_num, uint16_t val) {_TIM1_(ch_num*4 + 0x30) = val;}
	void pwmEnable(uint8_t ch_num);
	void pwmDisable(uint8_t ch_num);

	//for consistency with other timers. Here they enable the update event IRQ
	void IRQenable() {IRQ_0TO31_SER |= IRQ_TIM1_UP;}
	void IRQdisable() {IRQ_0TO31_CER |= IRQ_TIM1_UP;}

	//tim1 only
	void IRQ_BRK_enable() {IRQ_0TO31_SER |= IRQ_TIM1_BRK;}
	void IRQ_UP_enable() {IRQ_0TO31_SER |= IRQ_TIM1_UP;}
	void IRQ_TRG_COM_enable() {IRQ_0TO31_SER |= IRQ_TIM1_TRG_COM;}
	void IRQ_CC_enable() {IRQ_0TO31_SER |= IRQ_TIM1_CC;}
	void IRQ_BRK_disable() {IRQ_0TO31_CER |= IRQ_TIM1_BRK;}
	void IRQ_UP_disable() {IRQ_0TO31_CER |= IRQ_TIM1_UP;}
	void IRQ_TRG_COM_disable() {IRQ_0TO31_CER |= IRQ_TIM1_TRG_COM;}
	void IRQ_CC_disable() {IRQ_0TO31_CER |= IRQ_TIM1_CC;}

	//capture/compare channels
	void writeCC1(uint16_t val) {_TIM1_(TIMX_CCR1) = val;}
	void writeCC2(uint16_t val) {_TIM1_(TIMX_CCR2) = val;}
	void writeCC3(uint16_t val) {_TIM1_(TIMX_CCR3) = val;}
	void writeCC4(uint16_t val) {_TIM1_(TIMX_CCR4) = val;}

	void CC1output(uint8_t bit) {BB_TIM1_CCER_CC1E = bit;}
	void CC2output(uint8_t bit) {BB_TIM1_CCER_CC2E = bit;}
	void CC3output(uint8_t bit) {BB_TIM1_CCER_CC3E = bit;}
	void CC4output(uint8_t bit) {BB_TIM1_CCER_CC4E = bit;}

	//BB (atomic) stuff
	//update event enable/disable (CR1->UDIS)
	void updateDisable() {BB_TIM1_CR1_UDIS = 0;}
	void updateEnable() {BB_TIM1_CR1_UDIS = 1;}

	//fast interrupt enable/disable (1 or 0)
	void updateInterrupt(uint8_t bit) {BB_TIM1_DIER_UIE = bit;}
	void CC1interrupt(uint8_t bit) {BB_TIM1_DIER_CC1IE = bit;}
	void CC2interrupt(uint8_t bit) {BB_TIM1_DIER_CC2IE = bit;}
	void CC3interrupt(uint8_t bit) {BB_TIM1_DIER_CC3IE = bit;}
	void CC4interrupt(uint8_t bit) {BB_TIM1_DIER_CC4IE = bit;}
	void COMinterrupt(uint8_t bit) {BB_TIM1_DIER_COMIE = bit;}
	void triggerInterrupt(uint8_t bit) {BB_TIM1_DIER_TIE = bit;}
	void breakInterrupt(uint8_t bit) {BB_TIM1_DIER_BIE = bit;}

	//event generators
	void updateEvent() {BB_TIM1_EGR_UG = 1;}
	void CC1event() {BB_TIM1_EGR_CC1G = 1;}
	void CC2event() {BB_TIM1_EGR_CC2G = 1;}
	void CC3event() {BB_TIM1_EGR_CC3G = 1;}
	void CC4event() {BB_TIM1_EGR_CC4G = 1;}
	void COMevent() {BB_TIM1_EGR_COMG = 1;}
	void triggerEvent() {BB_TIM1_EGR_TG = 1;}
	void breakEvent() {BB_TIM1_EGR_BG = 1;}

	//interrupt flag cleaners, should use BB for these most certainly
	void clearUpdate() {BB_TIM1_SR_UIF = 0;}
	void clearCC1() {BB_TIM1_SR_CC1IF = 0;}
	void clearCC2() {BB_TIM1_SR_CC2IF = 0;}
	void clearCC3() {BB_TIM1_SR_CC3IF = 0;}
	void clearCC4() {BB_TIM1_SR_CC4IF = 0;}
	void clearCOM() {BB_TIM1_SR_COMIF = 0;}
	void clearTrigger() {BB_TIM1_SR_TIF = 0;}
	void clearBreak() {BB_TIM1_SR_BIF = 0;}
	void clearAll() {_TIM1_(TIMX_SR) = 0;}

private:
};

class timer2: public timer
{
public:
	timer2(uint16_t prsclr = 0x0000, uint16_t depth = 0xFFFF): timer(prsclr, depth) {}

 	void init() {timer2_init();}
	void config();
	void enableOnly() {BB_TIM2_CR1_CEN = 1;}
	void enable(uint16_t count = 0);
	void disable() {BB_TIM2_CR1_CEN = 0;}
	uint16_t read() {return _TIM2_(TIMX_CNT);}
	operator uint16_t() {return _TIM1_(TIMX_CNT);}

	void master(uint16_t mms, uint16_t ccmr = 0);
	void slave(uint16_t sms, uint16_t ts);

	void pwmSetup(uint8_t center, uint8_t dir);
	void pwmChannel(uint8_t ch_num, uint8_t mode, uint8_t plrty, uint8_t pushpull = 0);// {tim2_pwm a(ch_num); a.init();}
	void pwmWrite(uint8_t ch_num, uint16_t val) {_TIM2_(ch_num*4 + 0x30) = val;}
	void pwmEnable(uint8_t ch_num);
	void pwmDisable(uint8_t ch_num);

	void IRQenable() {IRQ_0TO31_SER |= IRQ_TIM2;}
	void IRQdisable() {IRQ_0TO31_CER |= IRQ_TIM2;}

	//capture/compare channels
	void writeCC1(uint16_t val) {_TIM2_(TIMX_CCR1) = val;}
	void writeCC2(uint16_t val) {_TIM2_(TIMX_CCR2) = val;}
	void writeCC3(uint16_t val) {_TIM2_(TIMX_CCR3) = val;}
	void writeCC4(uint16_t val) {_TIM2_(TIMX_CCR4) = val;}

	void CC1output(uint8_t bit) {BB_TIM2_CCER_CC1E = bit;}
	void CC2output(uint8_t bit) {BB_TIM2_CCER_CC2E = bit;}
	void CC3output(uint8_t bit) {BB_TIM2_CCER_CC3E = bit;}
	void CC4output(uint8_t bit) {BB_TIM2_CCER_CC4E = bit;}

	//BB (atomic) stuff
	//update event enable/disable (CR1->UDIS)
	void updateDisable() {BB_TIM2_CR1_UDIS = 0;}
	void updateEnable() {BB_TIM2_CR1_UDIS = 1;}

	//fast interrupt enable/disable (1 or 0)
	void updateInterrupt(uint8_t bit) {BB_TIM2_DIER_UIE = bit;}
	void CC1interrupt(uint8_t bit) {BB_TIM2_DIER_CC1IE = bit;}
	void CC2interrupt(uint8_t bit) {BB_TIM2_DIER_CC2IE = bit;}
	void CC3interrupt(uint8_t bit) {BB_TIM2_DIER_CC3IE = bit;}
	void CC4interrupt(uint8_t bit) {BB_TIM2_DIER_CC4IE = bit;}
	void triggerInterrupt(uint8_t bit) {BB_TIM2_DIER_TIE = bit;}

	//event generators
	void updateEvent() {BB_TIM2_EGR_UG = 1;}
	void CC1event() {BB_TIM2_EGR_CC1G = 1;}
	void CC2event() {BB_TIM2_EGR_CC2G = 1;}
	void CC3event() {BB_TIM2_EGR_CC3G = 1;}
	void CC4event() {BB_TIM2_EGR_CC4G = 1;}
	void triggerEvent() {BB_TIM2_EGR_TG = 1;}

	//interrupt flag cleaners, should use BB for these most certainly
	void clearUpdate() {BB_TIM2_SR_UIF = 0;} //{_TIM2_(TIMX_SR) &= ~TIMX_SR_UIF;}
	void clearCC1() {BB_TIM2_SR_CC1IF = 0;} //{_TIM2_(TIMX_SR) &= ~TIMX_SR_CC1IF;}
	void clearCC2() {BB_TIM2_SR_CC2IF = 0;} //{_TIM2_(TIMX_SR) &= ~TIMX_SR_CC2IF;}
	void clearCC3() {BB_TIM2_SR_CC3IF = 0;} //{_TIM2_(TIMX_SR) &= ~TIMX_SR_CC3IF;}
	void clearCC4() {BB_TIM2_SR_CC4IF = 0;} //{_TIM2_(TIMX_SR) &= ~TIMX_SR_CC4IF;}
	void clearTrigger() {BB_TIM2_SR_TIF = 0;} //{_TIM2_(TIMX_SR) &= ~TIMX_SR_TIF;}
	void clearAll() {_TIM2_(TIMX_SR) = 0;}


