Ontaelio/STM32F103-Ublink-framework/stm32f103_timers_func.h
private:

};

class timer3: public timer
{
public:
	timer3(uint16_t prsclr = 0x0000, uint16_t depth = 0xFFFF): timer(prsclr, depth) {}

 	void init() {timer3_init();}
	void config();
	void enableOnly() {BB_TIM3_CR1_CEN = 1;}
	void enable(uint16_t count = 0);
	void disable() {BB_TIM3_CR1_CEN = 0;}
	uint16_t read() {return _TIM3_(TIMX_CNT);}
	operator uint16_t() {return _TIM1_(TIMX_CNT);}

	void master(uint16_t mms, uint16_t ccmr = 0);
	void slave(uint16_t sms, uint16_t ts);

	void pwmSetup(uint8_t center, uint8_t dir);
	void pwmChannel(uint8_t ch_num, uint8_t mode, uint8_t plrty, uint8_t pushpull = 0);
	void pwmWrite(uint8_t ch_num, uint16_t val) {_TIM3_(ch_num*4 + 0x30) = val;}
	void pwmEnable(uint8_t ch_num);
	void pwmDisable(uint8_t ch_num);

	void IRQenable() {IRQ_0TO31_SER |= IRQ_TIM3;}
	void IRQdisable() {IRQ_0TO31_CER |= IRQ_TIM3;}

	//capture/compare channels
	void writeCC1(uint16_t val) {_TIM3_(TIMX_CCR1) = val;}
	void writeCC2(uint16_t val) {_TIM3_(TIMX_CCR2) = val;}
	void writeCC3(uint16_t val) {_TIM3_(TIMX_CCR3) = val;}
	void writeCC4(uint16_t val) {_TIM3_(TIMX_CCR4) = val;}

	void CC1output(uint8_t bit) {BB_TIM3_CCER_CC1E = bit;}
	void CC2output(uint8_t bit) {BB_TIM3_CCER_CC2E = bit;}
	void CC3output(uint8_t bit) {BB_TIM3_CCER_CC3E = bit;}
	void CC4output(uint8_t bit) {BB_TIM3_CCER_CC4E = bit;}

	//BB (atomic) stuff
	//update event enable/disable (CR1->UDIS)
	void updateDisable() {BB_TIM3_CR1_UDIS = 0;}
	void updateEnable() {BB_TIM3_CR1_UDIS = 1;}

	//fast interrupt enable/disable (1 or 0)
	void updateInterrupt(uint8_t bit) {BB_TIM3_DIER_UIE = bit;}
	void CC1interrupt(uint8_t bit) {BB_TIM3_DIER_CC1IE = bit;}
	void CC2interrupt(uint8_t bit) {BB_TIM3_DIER_CC2IE = bit;}
	void CC3interrupt(uint8_t bit) {BB_TIM3_DIER_CC3IE = bit;}
	void CC4interrupt(uint8_t bit) {BB_TIM3_DIER_CC4IE = bit;}
	void triggerInterrupt(uint8_t bit) {BB_TIM3_DIER_TIE = bit;}

	//event generators
	void updateEvent() {BB_TIM2_EGR_UG = 1;}
	void CC1event() {BB_TIM2_EGR_CC1G = 1;}
	void CC2event() {BB_TIM2_EGR_CC2G = 1;}
	void CC3event() {BB_TIM2_EGR_CC3G = 1;}
	void CC4event() {BB_TIM2_EGR_CC4G = 1;}
	void triggerEvent() {BB_TIM2_EGR_TG = 1;}

	//interrupt flag cleaners, should use BB for these most certainly
	void clearUpdate() {BB_TIM3_SR_UIF = 0;} //{_TIM3_(TIMX_SR) &= ~TIMX_SR_UIF;}
	void clearCC1() {BB_TIM3_SR_CC1IF = 0;} //{_TIM3_(TIMX_SR) &= ~TIMX_SR_CC1IF;}
	void clearCC2() {BB_TIM3_SR_CC2IF = 0;} //{_TIM3_(TIMX_SR) &= ~TIMX_SR_CC2IF;}
	void clearCC3() {BB_TIM3_SR_CC3IF = 0;} //{_TIM3_(TIMX_SR) &= ~TIMX_SR_CC3IF;}
	void clearCC4() {BB_TIM3_SR_CC4IF = 0;} //{_TIM3_(TIMX_SR) &= ~TIMX_SR_CC4IF;}
	void clearTrigger() {BB_TIM3_SR_TIF = 0;} //{_TIM3_(TIMX_SR) &= ~TIMX_SR_TIF;}
	void clearAll() {_TIM3_(TIMX_SR) = 0;}


private:

};

class timer4: public timer
{
public:
	timer4(uint16_t prsclr = 0x0000, uint16_t depth = 0xFFFF): timer(prsclr, depth) {}

 	void init() {timer4_init();}
	void config();
	void enableOnly() {BB_TIM4_CR1_CEN = 1;}
	void enable(uint16_t count = 0);
	void disable() {BB_TIM4_CR1_CEN = 0;}
	uint16_t read() {return _TIM4_(TIMX_CNT);}
	operator uint16_t() {return _TIM1_(TIMX_CNT);}

	void master(uint16_t mms, uint16_t ccmr = 0);
	void slave(uint16_t sms, uint16_t ts);

	void pwmSetup(uint8_t center, uint8_t dir);
	void pwmChannel(uint8_t ch_num, uint8_t mode, uint8_t plrty, uint8_t pushpull = 0);// {tim2_pwm a(ch_num); a.init();}
	void pwmWrite(uint8_t ch_num, uint16_t val) {_TIM4_(ch_num*4 + 0x30) = val;}
	void pwmEnable(uint8_t ch_num);
	void pwmDisable(uint8_t ch_num);

	void IRQenable() {IRQ_0TO31_SER |= IRQ_TIM4;}
	void IRQdisable() {IRQ_0TO31_CER |= IRQ_TIM4;}

	//capture/compare channels
	void writeCC1(uint16_t val) {_TIM4_(TIMX_CCR1) = val;}
	void writeCC2(uint16_t val) {_TIM4_(TIMX_CCR2) = val;}
	void writeCC3(uint16_t val) {_TIM4_(TIMX_CCR3) = val;}
	void writeCC4(uint16_t val) {_TIM4_(TIMX_CCR4) = val;}

	void CC1output(uint8_t bit) {BB_TIM4_CCER_CC1E = bit;}
	void CC2output(uint8_t bit) {BB_TIM4_CCER_CC2E = bit;}
	void CC3output(uint8_t bit) {BB_TIM4_CCER_CC3E = bit;}
	void CC4output(uint8_t bit) {BB_TIM4_CCER_CC4E = bit;}

	//BB (atomic) stuff
	//update event enable/disable (CR1->UDIS)
	void updateDisable() {BB_TIM4_CR1_UDIS = 0;}
	void updateEnable() {BB_TIM4_CR1_UDIS = 1;}

	//fast interrupt enable/disable (1 or 0)
	void updateInterrupt(uint8_t bit) {BB_TIM4_DIER_UIE = bit;}
	void CC1interrupt(uint8_t bit) {BB_TIM4_DIER_CC1IE = bit;}
	void CC2interrupt(uint8_t bit) {BB_TIM4_DIER_CC2IE = bit;}
	void CC3interrupt(uint8_t bit) {BB_TIM4_DIER_CC3IE = bit;}
	void CC4interrupt(uint8_t bit) {BB_TIM4_DIER_CC4IE = bit;}
	void triggerInterrupt(uint8_t bit) {BB_TIM4_DIER_TIE = bit;}

	//event generators
	void updateEvent() {BB_TIM4_EGR_UG = 1;}
	void CC1event() {BB_TIM4_EGR_CC1G = 1;}
	void CC2event() {BB_TIM4_EGR_CC2G = 1;}
	void CC3event() {BB_TIM4_EGR_CC3G = 1;}
	void CC4event() {BB_TIM4_EGR_CC4G = 1;}
	void triggerEvent() {BB_TIM4_EGR_TG = 1;}

	//interrupt flag cleaners, should use BB for these most certainly
	void clearUpdate() {BB_TIM4_SR_UIF = 0;} //{_TIM4_(TIMX_SR) &= ~TIMX_SR_UIF;}
	void clearCC1() {BB_TIM4_SR_CC1IF = 0;} //{_TIM4_(TIMX_SR) &= ~TIMX_SR_CC1IF;}
	void clearCC2() {BB_TIM4_SR_CC2IF = 0;} //{_TIM4_(TIMX_SR) &= ~TIMX_SR_CC2IF;}
	void clearCC3() {BB_TIM4_SR_CC3IF = 0;} //{_TIM4_(TIMX_SR) &= ~TIMX_SR_CC3IF;}
	void clearCC4() {BB_TIM4_SR_CC4IF = 0;} //{_TIM4_(TIMX_SR) &= ~TIMX_SR_CC4IF;}
	void clearTrigger() {BB_TIM4_SR_TIF = 0;} //{_TIM4_(TIMX_SR) &= ~TIMX_SR_TIF;}
	void clearAll() {_TIM4_(TIMX_SR) = 0;}

private:
};

#endif /* STM32F103_TIMERS_FUNC_H_ */
